Repository: muthuxv/unity-hub
Catalog: front/lib/l10n/app_*.arb
Languages: fr

# changes_to_policy_details
source: We may update this privacy and security policy from time to time. We will notify you of any substantial changes through our application or by email. We encourage you to review this policy regularly to stay informed about how we protect your information.
fr: Nous pouvons mettre à jour cette politique de confidentialité et de sécurité de temps en temps. Nous vous informerons de toute modification substantielle par le biais de notre application ou par e-mail. Nous vous encourageons à consulter régulièrement cette politique pour rester informé de la manière dont nous protégeons vos informations.

# contact_details
source: If you have any questions or concerns regarding this privacy and security policy, please contact us at:
fr: Si vous avez des questions ou des préoccupations concernant cette politique de confidentialité et de sécurité, veuillez nous contacter à l'adresse suivante :

# address
source: Address: UnityHub, 242 rue du Faubourg Saint-Antoine, 75012 Paris, France
fr: Adresse : UnityHub, 242 rue du Faubourg Saint-Antoine, 75012 Paris, France

# acceptance
source: By using UnityHub, you agree to the practices described in this privacy and security policy.
fr: En utilisant UnityHub, vous acceptez les pratiques décrites dans cette politique de confidentialité et de sécurité.
