Repository: muthuxv/unity-hub
Catalog: front/lib/l10n/app_*.arb
Languages: fr

# join_or_create_server
source: To get started, join a server or create your own!
fr: Pour commencer, rejoins un serveur ou crée le tien!

# settings_server
source: Server settings
fr: Paramètres du serveur

source: Members list
fr: Liste des membres

source: Leave server
fr: Quitter le serveur

# add_server
source: Add a Server
fr: Ajouter un serveur

# add_channel
source: Add a Channel
fr: Ajouter un channel

source: Invite Friends
fr: Inviter des amis

# friend_invitation
source: want to be your friend
fr: veut devnir votre ami

source: Server created
fr: Serveur créé

# create_server
source: Create your own server!
fr: Créer ton propre serveur!

# give_name_and_visibility
source: Give a name to your server and choose its visibility.
fr: Donne un nom à ton serveur et choisis sa visibilité.

# create_public_server
source: Create a public server for everyone.
fr: Créer un serveur public pour tout le monde.

# create_private_server
source: Create a private server for you.
fr: Créer un serveur privé pour toi et tes amis.

# server_name_label
source: Server name
fr: Nom du serveur

# tags_required_public
source: Tags are required for a public server.
fr: Les tags sont requis pour un serveur public.

# create_server_button
source: Create server
fr: Créer le serveur

# already_have_invitation_code
source: Already have an invitation code?
fr: Tu as déjà un code d'invitation?

# join_server_button
source: Join a server
fr: Rejoindre un serveur

# enter_invitation_link_title
source: Enter your invitation link
fr: Rentrez votre lien invitation

# invitation_link_label
source: Invitation link
fr: Lien invitation

# cancel_button
source: Cancel
fr: Annuler

# join_button
source: Join
fr: Rejoindre

# server_created_title
source: Server created
fr: Serveur créé

# server_created_message
source: The server was successfully created.
fr: Le serveur a été créé avec succès.

# server_name_required_error
source: Server name is required.
fr: Le nom du serveur est requis.

# public_server_tags_required_error
source: Tags are required for a public server.
fr: Les tags sont requis pour un serveur public.

# server_creation_error
source: An error occurred while creating the server.
fr: Une erreur s'est produite lors de la création du serveur.

# joined_server_success_message
source: You have successfully joined the server
fr: Vous avez rejoint le serveur avec succès

# join_server_error_message
source: An error occurred while joining the server
fr: Une erreur est survenue lors de la connexion au serveur

# channel_name_label
source: Channel name
fr: Nom du channel

# channel_type_label
source: Channel type
fr: Type de channel

# text_channel
source: #Text
fr: #Textuel

# text_channel_description
source: Send messages, emojis and more.
fr: Envoyez des messages, des emojis et pleins d'autres.

# voice_channel
source: #Voice
fr: #Vocal

# voice_channel_description
source: Talk with your friends in voice.
fr: Parlez avec vos amis en vocal.

# add_channel_button
source: Add Channel
fr: Ajouter

# channel_creation_error_title
source: Error
fr: Erreur

# channel_name_error_message
source: The channel name is required.
fr: Le nom du channel est requis.

# channel_name_empty_error_message
source: Channel name cannot be empty.
fr: Le nom du channel ne peut pas être vide.

# channel_name_error_title
source: Channel name error
fr: Erreur de nom

# channel_creation_error_message
source: An error occurred while creating the channel.
fr: Une erreur s'est produite lors de la création du channel.

# invitationSentSuccess
source: Invitation sent successfully
fr: Invitation envoyée avec succès

# invitationSendFailure
source: Failed to send invitation
fr: Échec de l'envoi de l'invitation

source: Send Invitations
fr: Envoyer les invitations

# sendButton
source: Send
fr: Envoyer

# text_channels_section
source: # Text Channels
fr: # Salons-textuels

# voice_channels_section
source: # Voice Channels
fr: # Salons-vocaux

# edit_channel_title
source: Edit Channel
fr: Modifier le salon

# edit_channel_name_label
source: Channel Name
fr: Nom du salon

# delete_channel_confirmation
source: Are you sure you want to delete this channel?
fr: Êtes-vous sûr de vouloir supprimer ce salon ?

# delete_channel_error_title
source: Error
fr: Erreur

# delete_channel_error_message
source: An error occurred while deleting the channel.
fr: Une erreur s'est produite lors de la suppression du salon.

# servers_tab
source: Servers
fr: Serveurs

# community_tab
source: Community
fr: Communauté

# profile_tab
source: Profile
fr: Profil

source: Server Members
fr: Membres du serveur

source: Invitation Link
fr: Lien d'invitation

# link_copied
source: Link copied to clipboard
fr: Lien copié dans le presse-papiers

source: Copy Link
fr: Copier le lien

source: Close
fr: Fermer

source: Server Settings
fr: Paramètres du serveur

source: Error
fr: Erreur

# avatar_update_error
source: An error occurred while updating the avatar.
fr: Une erreur s'est produite lors de la mise à jour de l'avatar.

source: Roles
fr: Rôles

source: Server Logs
fr: Logs du serveur

source: Bans
fr: Bannissements

source: Reports
fr: Signalements

source: Delete Server
fr: Supprimer le serveur

# delete_server_confirmation
source: Are you sure you want to delete this server?
fr: Êtes-vous sûr de vouloir supprimer ce serveur ?

source: Cancel
fr: Annuler

source: Delete
fr: Supprimer

# server_deletion_error
source: An error occurred while deleting the server.
fr: Une erreur s'est produite lors de la suppression du serveur.

source: Server Roles
fr: Les rôles du serveur

# failedLoadRoles
source: Failed to load roles
fr: Échec du chargement des rôles

# errorFetchingRoles
source: An error occurred while fetching roles
fr: Une erreur s'est produite lors de la récupération des rôles

# failedLoadUserData
source: Failed to load user data
fr: Échec du chargement des données utilisateur

# errorFetchingUserData
source: An error occurred while fetching user data
fr: Une erreur s'est produite lors de la récupération des données utilisateur

# failedDeleteRole
source: Failed to delete role
fr: Échec de la suppression du rôle

source: Create Role
fr: Créer un rôle

source: Role created successfully
fr: Rôle créé avec succès

# failedCreateRole
source: Failed to create role
fr: Échec de la création du rôle

# errorCreatingRole
source: An error occurred while creating the role
fr: Une erreur s'est produite lors de la création du rôle

source: Role Name
fr: Nom du rôle

# enterName
source: Please enter a name
fr: Veuillez entrer un nom

source: Create
fr: Créer

source: Modify Role
fr: Modifier le rôle

source: Role modified successfully
fr: Rôle modifié avec succès

# failedModifyRole
source: Failed to modify role
fr: Échec de la modification du rôle

# errorModifyingRole
source: An error occurred while modifying the role
fr: Une erreur s'est produite lors de la modification du rôle

source: Modify
fr: Modifier

# no_logs
source: No logs available
fr: Aucun log disponible

source: No server found
fr: Aucun serveur trouvé

# no_server_found_message
source: There is no server with this name
fr: Il n'y a pas de serveur portant ce nom

# failedLoadServerData
source: Failed to load server data
fr: Échec de la recherche de serveurs

source: Success
fr: Succès

source: Server joined successfully
fr: Vous avez rejoint le serveur avec succès.

# failedJoinServer
source: Failed to join server
fr: Échec de la jonction du serveur.

# joinServerConfirmation
source: Do you really want to join this server?
fr: Voulez-vous vraiment rejoindre ce serveur ?

source: Yes
fr: Oui

source: No
fr: Non

# no_public_servers
source: No public servers available
fr: Aucun serveur public disponible

source: Search server
fr: Rechercher un serveur

source: Profile
fr: Profil

source: Change Language
fr: Changer de langue

source: French
fr: Français

source: English
fr: Anglais

source: Connection error:
fr: Erreur de connexion:

source: About Me
fr: À propos de moi

# welcomeToProfile
source: Welcome to your profile! Edit your information or check your friends.
fr: Bienvenue sur votre profil ! Modifiez vos informations ou consultez vos amis.

source: Modify Profile
fr: Modifier le profil

source: My Friends
fr: Mes amis

# enterNewPseudo
source: Enter your new pseudo
fr: Entrez votre nouveau pseudo

# pseudoCannotBeEmpty
source: The pseudo cannot be empty
fr: Le pseudo ne peut pas être vide

source: Update
fr: Mettre à jour

source: Profile Updated
fr: Profil mis à jour

# pseudoUpdatedSuccessfully
source: Your pseudo has been updated successfully.
fr: Votre pseudo a été mis à jour avec succès.

source: Error updating profile
fr: Erreur lors de la mise à jour du profil

# takePhoto
source: Take a photo
fr: Prendre une photo

source: Choose from gallery
fr: Choisir depuis la galerie

source: Settings
fr: Paramètres

source: Account Settings
fr: Paramètres du compte

source: Account
fr: Compte

# privacyAndSecurity
source: Privacy & Security
fr: Confidentialités & Sécurité

source: Account Information
fr: Information du compte

source: Username
fr: Pseudo

source: Password
fr: Mot de passe

source: Change Password
fr: Changer le mot de passe

source: Current Password
fr: Mot de passe actuel

# enterCurrentPassword
source: Enter your current password
fr: Entrez votre mot de passe actuel

source: New Password
fr: Nouveau mot de passe

# enterNewPassword
source: Enter your new password
fr: Entrez votre nouveau mot de passe

source: Password cannot be empty
fr: Le mot de passe ne peut pas être vide

# newPasswordMinLength
source: New password must be at least 6 characters
fr: Le nouveau mot de passe doit avoir au moins 6 caractères

# passwordChanged
source: Your password has been changed successfully.
fr: Votre mot de passe a été changé avec succès.

source: Error updating password
fr: Erreur lors de la mise à jour du mot de passe

source: Modify Pseudo
fr: Modifier Pseudo

source: Pseudo Updated
fr: Pseudo mis à jour

# pseudoUpdatedSuccess
source: Your pseudo has been updated successfully.
fr: Votre pseudo a été mis à jour avec succès.

source: Error updating pseudo
fr: Erreur lors de la mise à jour du pseudo

source: Save
fr: Enregistrer

source: Modify Server Tags
fr: Modifier les tags du serveur

source: Current Server Tags:
fr: Tags actuels du serveur :

source: Select New Tags:
fr: Sélectionner les nouveaux tags :

source: Update Tags
fr: Mettre à jour les tags

source: Tags Updated
fr: Tags mis à jour

# tagsUpdatedSuccess
source: Your tags have been updated successfully.
fr: Vos tags ont été mis à jour avec succès.

# selectAtLeastOneTag
source: You must select at least one tag.
fr: Il faut sélectionner au moins un tag.

source: Logout
fr: Se déconnecter

source: No data available
fr: Aucune donnée disponible

source: Friend request accepted
fr: Demande d'ami acceptée avec succès

source: Friend request refused
fr: Demande d'ami refusée avec succès

source: Friend request cancelled
fr: Demande d'ami annulée avec succès

source: Error cancelling friend request
fr: Erreur lors de l'annulation de la demande d'ami

# unexpectedError
source: An unexpected error occurred
fr: Une erreur inattendue s'est produite

# wantToBeFriendWith
source: wants to be your friend
fr: Veux-tu être ami avec

source: Accept
fr: Accepter

source: Refuse
fr: Refuser

source: Invite to Server
fr: Inviter sur le serveur

# deleteFriendConfirmation
source: Are you sure you want to delete this friend?
fr: Êtes-vous sûr de supprimer cet ami ?

source: Friend deleted
fr: Ami supprimé avec succès

source: Error deleting friend
fr: Erreur lors de la suppression de l'ami

# unexpectedErrorOccurred
source: An unexpected error occurred
fr: Une erreur inattendue s'est produite

source: Add user by pseudo
fr: Ajouter par pseudo d'utilisateur

source: Who will be your new friend?
fr: Qui sera ton nouvel ami ?

# enterUserPseudo
source: Enter the user's pseudo
fr: Entrez un pseudo d'utilisateur

source: Send Friend Request
fr: Envoyer une demande d'ami

# friendRequest
source: Friend request sent
fr: Demande d'ami

# youReceivedFriendRequest
source: You received a friend request from
fr: Vous avez reçu une demande d'ami de

source: Cancel Friend Request
fr: Annuler la demande d'ami

# cancelFriendRequestConfirmation
source: Do you want to cancel friend request from
fr: Voulez-vous annuler la demande d'ami de

source: Back
fr: Retour

# noFriendRequestsSent
source: You haven't made a friend request yet
fr: Vous n'avez pas encore fait de demande d'ami

source: Friend request sent
fr: Demande d'ami envoyée

source: Search Friends...
fr: Rechercher des amis...

source: No friend requests
fr: Vous n'avez pas de demande d'ami

# noFriendsYet
source: You don't have any friends yet ðŸ˜­
fr: Pas encore d'ami 😭

source: Friends
fr: Amis

source: Add Friends
fr: Ajouter des amis

# maintenanceMessage
source: This feature is currently under maintenance.
fr: Cette fonctionnalité est actuellement en maintenance.

# errorTitle
source: Error
fr: Erreur

# closeButton
source: Close
fr: Fermer

source: No invitations
fr: Aucune invitation

# invitationMessage
source: invites you to join the server {serverName}.
fr: vous invite à rejoindre le serveur {serverName}.

# acceptInvitationError
source: Failed to accept invitation
fr: Échec de l'acceptation de l'invitation

# deleteInvitationError
source: Failed to delete invitation
fr: Échec de la suppression de l'invitation

# joinSuccessMessage
source: You have successfully joined the server
fr: Vous avez rejoint le serveur avec succès

source: Ban Member
fr: Bannir le membre

# banMemberConfirmation
source: Are you sure you want to ban this member?
fr: Êtes-vous sûr de vouloir bannir ce membre ?

source: Reason
fr: Raison

source: Duration
fr: Durée

# fillAllFields
source: Please fill in all fields
fr: Merci de remplir tous les champs

source: Banned Members
fr: Membres bannis

source: No banned members
fr: Aucun membre banni

source: Banned for
fr: Banni pour

source: Banned until
fr: Banni jusqu'à

# unbanMemberConfirmation
source: Are you sure you want to unban this member?
fr: Êtes-vous sûr de vouloir débannir ce membre ?

# unbanMemberConfirmationMessage
source: This member will be able to join the server again.
fr: Vous êtes sur le point de débannir ce membre.

source: Member unbanned
fr: Membre débanni

source: Member banned successfully
fr: Membre banni avec succès

# failedBanMember
source: Failed to ban member
fr: Échec du bannissement du membre

# youAreCurrentUser
source: You are the current user
fr: Vous êtes l'utilisateur courant

# onlyServerCreatorCanDeleteServer
source: Only the server creator can delete the server.
fr: Seul le créateur du serveur peut le supprimer

# notServerCreator
source: You are not the server creator
fr: Vous n'êtes pas le créateur du serveur

# onlyServerCreator
source: Only the server creator can perform this action.
fr: Seul le créateur du serveur peut effectuer cette action

source: Pending
fr: En attente

source: Generate New Avatar
fr: Générer un nouvel avatar

source: Profile Picture Updated
fr: Photo de profil mise à jour

# pseudoAlreadyExists
source: This pseudo already exists
fr: Ce pseudo existe déjà

# leaveServerConfirmation
source: Are you sure you want to leave the server?
fr: Êtes-vous sûr de vouloir quitter ce serveur ?

# confirmButton
source: Confirm
fr: Confirmer

# selectServer
source: Select a Server
fr: Sélectionner un serveur

source: Member kicked successfully
fr: Membre expulsé avec succès

# failedKickMember
source: Failed to kick member
fr: Échec de l'expulsion du membre

source: Kick Member
fr: Expulser le membre

source: Filter by tag
fr: Filtrer par tag

source: All
fr: Tous

# privacy_and_security_policy
source: UnityHub Privacy and Security Policy
fr: Politique de Confidentialité et de Sécurité de UnityHub

# welcome_message
source: Welcome to UnityHub. We place great importance on the privacy and security of your data. This policy explains how we collect, use, protect, and share your information when you use our application.
fr: Bienvenue sur UnityHub. Nous accordons une grande importance à la confidentialité et à la sécurité de vos données. Cette politique explique comment nous collectons, utilisons, protégeons et partageons vos informations lorsque vous utilisez notre application.

# information_collection
source: 1. Information Collection
fr: 1. Collecte d'Informations

# information_collection_details
source: We collect different types of information to provide you with the best possible service:
fr: Nous collectons différents types d'informations afin de vous fournir un service optimal :

# account_information
source: Account Information: When you create an account on UnityHub, we collect your name, email address, username, and password.
fr: Informations de Compte : Lorsque vous créez un compte sur UnityHub, nous collectons votre nom, adresse e-mail, nom d'utilisateur et mot de passe.

# communication_information
source: Communication Information: We collect the messages, files, and other content you share through our application.
fr: Informations de Communication : Nous collectons les messages, les fichiers, et les autres contenus que vous partagez via notre application.

# usage_data
source: Usage Data: We collect information about how you use UnityHub, including interactions with other users, preferences, and settings.
fr: Données d'Utilisation : Nous recueillons des informations sur la manière dont vous utilisez UnityHub, y compris les interactions avec d'autres utilisateurs, les préférences et les paramètres.

# technical_information
source: Technical Information: We collect information about your device, such as hardware type, operating system, IP address, and connection data.
fr: Informations Techniques : Nous collectons des informations sur votre appareil, comme le type de matériel, le système d'exploitation, l'adresse IP et les données de connexion.

# use_of_information
source: 2. Use of Information
fr: 2. Utilisation des Informations

# use_of_information_details
source: We use the information we collect to:
fr: Nous utilisons les informations que nous collectons pour :

# provide_services
source: Provide and improve our services.
fr: Fournir et améliorer nos services.

# personalize_experience
source: Personalize your user experience.
fr: Personnaliser votre expérience utilisateur.

# ensure_security
source: Ensure the security and stability of our platform.
fr: Assurer la sécurité et la stabilité de notre plateforme.

# communicate_updates
source: Communicate with you about updates, new features, and customer support.
fr: Communiquer avec vous à propos de mises à jour, de nouvelles fonctionnalités et d'assistance client.

# analyze_trends
source: Analyze trends and usage to improve our service.
fr: Analyser les tendances et les usages pour améliorer notre service.

# sharing_information
source: 3. Sharing of Information
fr: 3. Partage des Informations

# sharing_information_details
source: We only share your personal information with:
fr: Nous ne partageons vos informations personnelles qu'avec :

# service_providers
source: Service Providers: Third parties that help us provide and improve our services, subject to strict confidentiality agreements.
fr: Fournisseurs de Services : Des tiers qui nous aident à fournir et à améliorer nos services, sous réserve d'accords de confidentialité stricts.

# legal_obligations
source: Legal Obligations: If we are legally required to disclose your information to comply with legal obligations, regulations, or requests from competent authorities.
fr: Obligations Légales : Si nous sommes légalement tenus de divulguer vos informations pour répondre à des obligations juridiques, des règlements ou des demandes des autorités compétentes.

# protection_of_rights
source: Protection of Rights: If we need to protect and defend the rights or property of UnityHub, its users, or the public.
fr: Protection des Droits : Si nous devons protéger et défendre les droits ou la propriété de UnityHub, de ses utilisateurs ou du public.

# information_security
source: 4. Information Security
fr: 4. Sécurité des Informations

# information_security_details
source: We implement various security measures to protect your information:
fr: Nous mettons en œuvre diverses mesures de sécurité pour protéger vos informations :

# encryption
source: Encryption: All communications on UnityHub are encrypted to protect your data during transmission.
fr: Chiffrement : Toutes les communications sur UnityHub sont chiffrées pour protéger vos données pendant la transmission.

# access_controls
source: Access Controls: Only authorized employees have access to personal information, and they are subject to strict confidentiality obligations.
fr: Contrôles d'Accès : Seuls les employés autorisés ont accès aux informations personnelles, et ils sont soumis à des obligations de confidentialité strictes.

# monitoring
source: Monitoring: We regularly monitor our systems to detect and prevent any suspicious or malicious activity.
fr: Surveillance : Nous surveillons régulièrement nos systèmes pour détecter et prévenir toute activité suspecte ou malveillante.

# backups
source: Backups: We perform regular backups of your data to prevent accidental loss.
fr: Sauvegardes : Nous effectuons des sauvegardes régulières de vos données pour prévenir toute perte accidentelle.

# your_rights
source: 5. Your Rights and Choices
fr: 5. Vos Droits et Choix

# your_rights_details
source: You have certain rights regarding your personal information:
fr: Vous avez certains droits concernant vos informations personnelles :

# access_and_correction
source: Access and Correction: You can access your personal information and correct it if it is inaccurate.
fr: Accès et Correction : Vous pouvez accéder à vos informations personnelles et les corriger si elles sont inexactes.

# deletion
source: Deletion: You can request the deletion of your personal information, subject to legal obligations and operational necessities.
fr: Suppression : Vous pouvez demander la suppression de vos informations personnelles, sous réserve des obligations légales et des nécessités opérationnelles.

# portability
source: Portability: You can request a copy of your data in a structured, commonly used, and machine-readable format.
fr: Portabilité : Vous pouvez demander une copie de vos données dans un format structuré, couramment utilisé et lisible par machine.

# objection
source: Objection: You can object to the processing of your data for legitimate reasons.
fr: Opposition : Vous pouvez vous opposer au traitement de vos données pour des raisons légitimes.

# data_retention
source: 6. Data Retention
fr: 6. Conservation des Données

# data_retention_details
source: We retain your personal information as long as necessary to provide our services and for other legitimate purposes, such as complying with legal obligations, resolving disputes, and enforcing our agreements.
fr: Nous conservons vos informations personnelles aussi longtemps que nécessaire pour fournir nos services et pour d'autres fins légitimes, telles que le respect des obligations légales, la résolution des litiges et l'application de nos accords.

# changes_to_policy
source: 7. Changes to This Policy
fr: 7. Modifications de cette Politique
